# GetAbsoluteDisplacement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetAbsoluteDisplacement Method
DisplacementElement Class See Also
---
The absolute displacement applied to the displaced elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ GetAbsoluteDisplacement()
```

Visual Basic
---
```text
Public Function GetAbsoluteDisplacement As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetAbsoluteDisplacement()
```

# ### Return Value
The absolute displacement.
# Remarks
The value is the relative translation of this DisplacementElement plus the relative displacements of all of its ancestor DisplacementElements.
# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace